teslabs/pebble-firmware/src/fw/drivers/nrf5/qspi.c
  nrfx_qspi_config_t config = NRFX_QSPI_DEFAULT_CONFIG(
      dev->qspi->clk_gpio, dev->qspi->cs_gpio, dev->qspi->data_gpio[0], dev->qspi->data_gpio[1],
      dev->qspi->data_gpio[2], dev->qspi->data_gpio[3]);
  config.phy_if.sck_freq = NRF_QSPI_FREQ_32MDIV1;

  switch (dev->read_mode) {
    case QSPI_FLASH_READ_READ2O:
      config.prot_if.readoc = NRF_QSPI_READOC_READ2O;
      break;
    case QSPI_FLASH_READ_READ2IO:
      config.prot_if.readoc = NRF_QSPI_READOC_READ2IO;
      break;
    case QSPI_FLASH_READ_READ4O:
      config.prot_if.readoc = NRF_QSPI_READOC_READ4O;
      break;
    case QSPI_FLASH_READ_READ4IO:
      config.prot_if.readoc = NRF_QSPI_READOC_READ4IO;
      break;
    default:
      config.prot_if.readoc = NRF_QSPI_READOC_FASTREAD;
      break;
  }

  switch (dev->write_mode) {
    case QSPI_FLASH_WRITE_PP2O:
      config.prot_if.writeoc = NRF_QSPI_WRITEOC_PP2O;
      break;
    case QSPI_FLASH_WRITE_PP4O:
      config.prot_if.writeoc = NRF_QSPI_WRITEOC_PP4O;
      break;
    case QSPI_FLASH_WRITE_PP4IO:
      config.prot_if.writeoc = NRF_QSPI_WRITEOC_PP4IO;
      break;
    default:
      config.prot_if.writeoc = NRF_QSPI_WRITEOC_PP;
      break;
  }

  nrfx_err_t err;
  if (was_init) {
    nrfx_qspi_uninit();
  }
  err = nrfx_qspi_init(&config, coredump_mode ? NULL : _flash_handler, (void *)dev);
  PBL_ASSERTN(err == NRFX_SUCCESS);
  was_init = 1;

  if (dev->reset_gpio.gpio) {
    WTF;
  }

  // we do not enter QPI mode on nRF5
  // Reset the flash to stop any program's or erase in progress from before reboot
  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.reset_enable);
  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.reset);

  if (coredump_mode) {
    delay_us(dev->state->part->reset_latency_ms * 1000);
  } else {
    psleep(dev->state->part->reset_latency_ms);
  }

  if (!coredump_mode) {
    prv_check_whoami(dev);
  }

  prv_configure_qe(dev);
}

status_t qspi_flash_is_erase_complete(QSPIFlash *dev) {
  uint8_t status_reg;
  uint8_t flag_status_reg;
  prv_read_register(dev->qspi, dev->state->part->instructions.rdsr1, &status_reg, 1);
  prv_read_register(dev->qspi, dev->state->part->instructions.rdsr2, &flag_status_reg, 1);

  if (status_reg & dev->state->part->status_bit_masks.busy) {
    return E_BUSY;
  } else if (flag_status_reg & dev->state->part->flag_status_bit_masks.erase_suspend) {
    return E_AGAIN;
  } else {
    return S_SUCCESS;
  }
}

status_t qspi_flash_erase_begin(QSPIFlash *dev, uint32_t addr, bool is_subsector) {
  prv_write_protection_set(dev, false);

  nrfx_err_t err =
      nrfx_qspi_erase(is_subsector ? NRF_QSPI_ERASE_LEN_4KB : NRF_QSPI_ERASE_LEN_64KB, addr);
  PBL_ASSERTN(err == NRFX_SUCCESS);

  prv_wait_for_completion(dev);

  // wait for busy to be set indicating the erase has started
  const uint32_t busy_timeout_us = 500;
  const bool result =
      prv_poll_bit(dev->qspi, dev->state->part->instructions.rdsr1,
                   dev->state->part->status_bit_masks.busy, true /* set */, busy_timeout_us);

  prv_write_protection_set(dev, true);

  return result ? S_SUCCESS : E_ERROR;
}

status_t qspi_flash_erase_suspend(QSPIFlash *dev, uint32_t addr) {
  uint8_t status_reg;
  prv_read_register(dev->qspi, dev->state->part->instructions.rdsr1, &status_reg, 1);
  if (!(status_reg & dev->state->part->status_bit_masks.busy)) {
    // no erase in progress
    return S_NO_ACTION_REQUIRED;
  }

  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.erase_suspend);

  if (dev->state->part->suspend_to_read_latency_us) {
    delay_us(dev->state->part->suspend_to_read_latency_us);
  }

  return S_SUCCESS;
}

void qspi_flash_erase_resume(QSPIFlash *dev, uint32_t addr) {
  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.erase_resume);
  // wait for the erase_suspend bit to be cleared
  prv_poll_bit(dev->qspi, dev->state->part->instructions.rdsr2,
               dev->state->part->flag_status_bit_masks.erase_suspend, false /* !set */,
               QSPI_NO_TIMEOUT);
}

void qspi_flash_read_blocking(QSPIFlash *dev, uint32_t addr, void *buffer, uint32_t length) {
  uint8_t *bufferp = buffer;
  uint8_t flash_pre;
  uint32_t flash_mid;
  uint8_t flash_suf;
  uint8_t dst_pre;
  uint32_t dst_mid;
  nrfx_err_t res;

  // compute flash pre/post boundary and middle bytes
  //
  // pre-addr     mid-addr                         suf-addr
  //    |  addr      |                                |
  //    |   |________|________ length ________________|__
  //    |   |        |                                |  |
  //    N   |       N+4        N+4*2   N+4*M      N+4*(M+1)
  // ...|[ ][x][x][x]|[x][x][x][x]|......|[x][x][x][x]|[x][ ][ ][ ]|...
  //        \_______/ \______________________________/ \_/
  //        flash_pre            flash_mid          flash_suf

  flash_pre = (WORD_SIZE - (addr % WORD_SIZE)) % WORD_SIZE;
  if (flash_pre > length) {
    flash_pre = length;
  }

  flash_suf = (length - flash_pre) % WORD_SIZE;
  flash_mid = length - flash_pre - flash_suf;

  // if RAM buffer is not word-aligned, compute pre-boundary bytes so we can
  // read them using a word-aligned bounce buffer
  dst_pre = (WORD_SIZE - (uintptr_t)buffer % WORD_SIZE) % WORD_SIZE;
  if (dst_pre > length) {
    dst_pre = length;
  }

  dst_mid = length - dst_pre - (length - dst_pre) % WORD_SIZE;

  // adjust what we can read from flash middle block, if RAM buffer is not word
  // aligned but flash address is, we could have 2 word blocks less available.
  if (flash_mid > dst_mid) {
    flash_mid = dst_mid;
    flash_suf = length - flash_pre - flash_mid;
  }

  // read from aligned flash to aligned RAM
  if (flash_mid != 0U) {
    res = nrfx_qspi_read(bufferp + dst_pre, flash_mid, addr + flash_pre);
    prv_wait_for_completion(dev);
    PBL_ASSERTN(res == NRFX_SUCCESS);

    // perform shift in RAM
    if (flash_pre != dst_pre) {
      memmove(bufferp + flash_pre, bufferp + dst_pre, flash_mid);
    }
  }

  // read prefix
  if (flash_pre != 0U) {
    res = nrfx_qspi_read(s_io_bounce_buffer, WORD_SIZE, addr - (WORD_SIZE - (addr % WORD_SIZE)));
    prv_wait_for_completion(dev);
    PBL_ASSERTN(res == NRFX_SUCCESS);
    memcpy(bufferp, s_io_bounce_buffer + WORD_SIZE - flash_pre, flash_pre);
  }

