teslabs/pebble-firmware/src/fw/drivers/nrf5/qspi.c
  // read suffix
  if (flash_suf != 0U) {
    res = nrfx_qspi_read(s_io_bounce_buffer, WORD_SIZE * 2, addr + flash_pre + flash_mid);
    prv_wait_for_completion(dev);
    PBL_ASSERTN(res == NRFX_SUCCESS);
    memcpy(bufferp + flash_pre + flash_mid, s_io_bounce_buffer, flash_suf);
  }
}

static void prv_write_page_begin(QSPIFlash *dev, const void *buffer, uint32_t addr,
                                 uint32_t length) {
  PBL_ASSERTN(length > 0);

  nrfx_err_t err = nrfx_qspi_write(buffer, length, addr);
  PBL_ASSERTN(err == NRFX_SUCCESS);

  prv_wait_for_completion(dev);
}

int qspi_flash_write_page_begin(QSPIFlash *dev, const void *buffer, uint32_t addr,
                                uint32_t length) {
  const uint32_t offset_in_page = addr % PAGE_SIZE_BYTES;
  uint32_t bytes_in_page = MIN(PAGE_SIZE_BYTES - offset_in_page, length);

  if (!nrfx_is_in_ram(buffer)) {
    /* we cannot DMA from non-RAM, so bounce through a RAM buffer if we have
     * to; this is not performant but it is ok because any time we are
     * writing to QSPI flash from internal flash, it is during
     * initialization and should be pretty infrequent
     */
    bytes_in_page = MIN(bytes_in_page, sizeof(s_io_bounce_buffer));
    memcpy(s_io_bounce_buffer, buffer, bytes_in_page);
    buffer = s_io_bounce_buffer;
    /* s_io_bounce_buffer does not get overwritten because nobody will call
     * us again until qspi_flash_get_write_status completes
     */
  }

  length = bytes_in_page;

  prv_write_protection_set(dev, false);

  uint32_t buf_p = (uint32_t)buffer;
  if (buf_p & 3) {
    /* argh ... */
    uint32_t align_len = 4 - (buf_p & 3);
    uint32_t tbuf = 0xFFFFFFFF;
    if (align_len > length) {
      align_len = length;
    }

    memcpy(&tbuf, buffer, align_len);
    prv_write_page_begin(dev, &tbuf, addr, 4);
    length -= align_len;
    addr += align_len;
    buffer = ((uint8_t *)buffer) + align_len;
  }

  uint32_t tail_len = length & 3;
  length -= tail_len;
  if (length) {
    prv_write_page_begin(dev, buffer, addr, length);
    addr += length;
    buffer = ((uint8_t *)buffer) + length;
  }

  if (tail_len) {
    uint32_t tbuf = 0xFFFFFFFF;
    memcpy(&tbuf, buffer, tail_len);
    prv_write_page_begin(dev, &tbuf, addr, 4);
  }

  prv_write_protection_set(dev, true);

  return bytes_in_page;
}

status_t qspi_flash_get_write_status(QSPIFlash *dev) {
  return nrfx_qspi_mem_busy_check() == NRFX_SUCCESS ? S_SUCCESS : E_BUSY;
}

void qspi_flash_set_lower_power_mode(QSPIFlash *dev, bool active) {
  uint8_t instruction;
  uint32_t delay;
  if (active) {
    instruction = dev->state->part->instructions.enter_low_power;
    delay = dev->state->part->standby_to_low_power_latency_us;
  } else {
    instruction = dev->state->part->instructions.exit_low_power;
    delay = dev->state->part->low_power_to_standby_latency_us;
  }
  prv_write_cmd_no_addr(dev->qspi, instruction);
  if (delay) {
    delay_us(delay);
  }
}

static bool prv_blank_check_poll(QSPIFlash *dev, uint32_t addr, bool is_subsector) {
  const uint32_t size_bytes = is_subsector ? SUBSECTOR_SIZE_BYTES : SECTOR_SIZE_BYTES;
  const uint32_t BUF_SIZE_BYTES = 128;
  const uint32_t BUF_SIZE_WORDS = BUF_SIZE_BYTES / sizeof(uint32_t);
  uint32_t buffer[BUF_SIZE_WORDS];
  for (uint32_t offset = 0; offset < size_bytes; offset += BUF_SIZE_BYTES) {
    flash_impl_read_sync(buffer, addr + offset, BUF_SIZE_BYTES);
    for (uint32_t i = 0; i < BUF_SIZE_WORDS; ++i) {
      if (buffer[i] != FLASH_RESET_WORD_VALUE) {
        return false;
      }
    }
  }
  return true;
}

status_t qspi_flash_blank_check(QSPIFlash *dev, uint32_t addr, bool is_subsector) {
  const bool result = prv_blank_check_poll(dev, addr, is_subsector);
  return result ? S_TRUE : S_FALSE;
}

void qspi_flash_ll_set_register_bits(QSPIFlash *dev, uint8_t read_instruction,
                                     uint8_t write_instruction, uint8_t value, uint8_t mask) {
  // make sure we're not trying to set any bits not within the mask
  PBL_ASSERTN((value & mask) == value);

  // first read the register
  uint8_t reg_value;
  prv_read_register(dev->qspi, read_instruction, &reg_value, 1);

  // set the desired bits
  reg_value = (reg_value & ~mask) | value;

  // enable writing and write the register value
  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.write_enable);
  qspi_indirect_write_no_addr(dev->qspi, write_instruction, &reg_value, 1);
}

status_t qspi_flash_write_protection_enable(QSPIFlash *dev) { return S_NO_ACTION_REQUIRED; }

status_t qspi_flash_lock_sector(QSPIFlash *dev, uint32_t addr) { return S_SUCCESS; }

status_t qspi_flash_unlock_all(QSPIFlash *dev) { return S_SUCCESS; }

#if !RELEASE
#include "console/prompt.h"
#include "drivers/flash.h"
#include "kernel/pbl_malloc.h"
#include "system/profiler.h"
#include "util/size.h"

static bool prv_flash_read_verify(QSPIFlash *dev, int size, int offset) {
  bool success = true;

  profiler_start();
  // prv_read_mmap(dev, 0, buffer_mmap, size);
  profiler_stop();
  uint32_t mmap_time = profiler_get_total_duration(true);

  const int buf_size = 64;
  char buf[buf_size];
  prompt_send_response_fmt(buf, buf_size, "Size: %d UNIMPL: MMP: %" PRIu32, size, mmap_time);

  return success;
}

struct FlashReadTestValues {
  int size;
  int offset;
};

const struct FlashReadTestValues FLASH_READ_TEST_TABLE[] = {
    {.size = 1024, .offset = 0}, {.size = 1025, .offset = 0}, {.size = 1026, .offset = 0},
    {.size = 1027, .offset = 0}, {.size = 1024, .offset = 1}, {.size = 1025, .offset = 2},
    {.size = 1026, .offset = 3}, {.size = 4, .offset = 0},    {.size = 20, .offset = 0},
    {.size = 60, .offset = 0},   {.size = 127, .offset = 0},  {.size = 128, .offset = 0},
};

void command_flash_apicheck(const char *len_str) {
  QSPIFlash *dev = QSPI_FLASH;
  const int buf_size = 64;
  char buf[buf_size];
  int failures = 0;
  int passes = 0;

  profiler_init();

  prompt_send_response("Check whoami");
  if (!qspi_flash_check_whoami(dev)) {
    ++failures;
    prompt_send_response("ERROR: Who am I failed");
  } else {
    ++passes;
  }

  prompt_send_response("Enter low power mode");
  flash_impl_enter_low_power_mode();

  // WHOAMI should fail in low-power mode
  prompt_send_response("Check whoami, should fail in low power mode");
  if (qspi_flash_check_whoami(dev)) {
    ++failures;
    prompt_send_response("ERROR: Who am I failed");
  } else {
    ++passes;
  }

  prompt_send_response("Exit low power mode");
  flash_impl_exit_low_power_mode();

  prompt_send_response("Start flash_read_verify test");

  const int final_size = atoi(len_str);

